import { LucideProps, CircleCheckBig } from 'lucide-react';

export const NavLinks = [
  { name: 'হোম', href: '/' },
  { name: 'আমাদের সম্পর্কে', href: '#about' },
  { name: 'সেবা সমূহ', href: '#services' },
  { name: 'কিভাবে পোডাক্ট পাবে', href: '#product-process' },
  { name: 'যোগাযোগ', href: '#contact' },
];

export const ShortService = [
  [
    {
      title: 'বিশ্বস্ত এবং নির্ভরযোগ্য আমদানিকারক কোম্পানি',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'চীনের শীর্ষস্থানীয় বাজার থেকে সরাসরি আমদানি',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'সাশ্রয়ী মূল্য এবং দ্রুত ডেলিভারি',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
  ],
  [
    {
      title: 'সহজ এবং সুবিধাজনক অনলাইন অর্ডার প্রক্রিয়া',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'পেশাদার কাস্টমস ক্লিয়ারেন্স এবং শিপিং সেবা',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'গ্রাহক সন্তুষ্টি এবং সমর্থনে অগ্রণী',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
  ],
];

export const FAQ = [
  {
    title: 'Sample Order দেওয়া যাবে?',
    description:
      'হ্যাঁ, আপনি প্রথমে Sample Order দিতে পারেন। এতে কোয়ালিটি যাচাই করা সহজ হয়।',
  },
  {
    title: 'আমি কি হোলসেল অর্ডার দিতে পারবো',
    description:
      'অবশ্যই, আমরা হোলসেল ও কর্পোরেট অর্ডার গ্রহণ করি। ইনবক্সে বিস্তারিত জানান।',
  },
  {
    title: 'প্রি-অর্ডার মানে কী?',
    description:
      'প্রি-অর্ডার মানে হচ্ছে পণ্যটি আমাদের স্টকে নেই — আমরা চীনের ফ্যাক্টরি থেকে অর্ডার করে আনব। এজন্য ৫০%-৭০% অগ্রিম পেমেন্ট লাগে।',
  },
  {
    title: 'আমি কিভাবে অর্ডার করবো?',
    description:
      'আপনার পছন্দের প্রোডাক্টের স্ক্রিনশট বা ছবি ইনবক্সে পাঠান। আমাদের টিম পণ্যের দাম এবং পেমেন্ট প্রসেস জানিয়ে দেবে।',
  },
  {
    title: 'ডেলিভারি সময় কত লাগে?',
    description:
      'প্রি-অর্ডার পণ্য: ১৩–১৫ দিন ( China To Dhaka )। স্টক পণ্য: ২-৩ কার্যদিবসের মধ্যে ডেলিভারি সম্পন্ন হয়।',
  },
  {
    title: 'পেমেন্ট কিভাবে করবো?',
    description:
      'আমরা নিচের পদ্ধতিতে পেমেন্ট গ্রহণ করিঃ বিকাশ, নগদ, রকেট, ব্যাংক ট্রান্সফার।',
  },
  {
    title: 'প্রোডাক্ট ভুল বা ড্যামেজ এলে কী হবে?',
    description:
      'চিন্তা নেই 😊 ডেলিভারির সময় কোনো সমস্যা হলে রিফান্ড বা রিপ্লেসমেন্ট দেওয়া হয় (প্রমাণসহ জানাতে হবে)।',
  },
];

export const ProductsProcessContent = [
  {
    title: 'পণ্যনির্বাচন',
    content: (
      <div>
        <p className="mb-8 text-xs font-normal text-neutral-800 md:text-sm dark:text-neutral-200">
          আপনি যেই পণ্য আনতে চান, তার লিংক বা ছবি আমাদের
          পাঠান। আমরা সরাসরি চায়না ফ্যাক্টরি থেকে দাম ও
          কোয়ালিটি যাচাই করবো ।
        </p>
      </div>
    ),
  },
  {
    title: 'মূল্যনিশ্চয়ন',
    content: (
      <div>
        <p className="mb-8 text-xs font-normal text-neutral-800 md:text-sm dark:text-neutral-200">
          আমরা আপনাকে শিপিং খরচ ও ভ্যাট সহ একটা পণ্যের মোট
          দাম এবং আনুমানিক ডেলিভারি সময় জানিয়ে দিবো। আমাদের
          পলিসি অনুযায়ী Pre Order পণ্যের দামের ৬০% অগ্রিম
          পেমেন্ট করে আপনি সম্মতি দিলে অর্ডার কনফার্ম হয়।
        </p>
      </div>
    ),
  },
  {
    title: 'কারখানাপ্রেরণ',
    content: (
      <div>
        <p className="mb-4 text-xs font-normal text-neutral-800 md:text-sm dark:text-neutral-200">
          আমাদের টিম ফ্যাক্টরি থেকে পণ্য সংগ্রহ করে
          নিরাপদভাবে বাংলাদেশে পাঠায়। আপনি চাইলে ট্র্যাকিং
          আপডেটও পাবেন।
        </p>
      </div>
    ),
  },
  {
    title: 'শুল্কছাড়',
    content: (
      <div>
        <p className="mb-4 text-xs font-normal text-neutral-800 md:text-sm dark:text-neutral-200">
          আমরা আপনার হয়ে সব কাস্টমস, ট্যাক্স ও ভ্যাট
          প্রক্রিয়া সম্পন্ন করি। তাই আপনাকে কোনো ঝামেলা নিতে
          হবে না। যেহেতু পণ্যের দামের ভিতরে কাস্টমস, ট্যাক্স
          ও ভ্যাট অন্তর্ভুক্ত তাই আপনাকে অতিরিক্ত কোনো টাকা
          পরিশোধ করা লাগবে না।
        </p>
      </div>
    ),
  },
  {
    title: 'বিতরণ',
    content: (
      <div>
        <p className="mb-4 text-xs font-normal text-neutral-800 md:text-sm dark:text-neutral-200">
          সবশেষে পণ্যটি নিরাপদে আপনার হাতে পৌঁছে দেওয়া হয় —
          এক্ষেত্রে ঢাকা হতে আপনার ঠিকানায় কুরিয়ার খরচ
          আপনাকে বহন করতে হবে। চায়না থেকে মাত্র ১৪-১৮ দিনে!
        </p>
      </div>
    ),
  },
];
