import { LucideProps, CircleCheckBig } from 'lucide-react';

export const NavLinks = [
  { name: 'হোম', href: '/' },
  { name: 'আমাদের সম্পর্কে', href: '#about' },
  { name: 'সেবা সমূহ', href: '#services' },
  { name: 'কিভাবে পোডাক্ট পাবে', href: '#product-process' },
  { name: 'যোগাযোগ', href: '#contact' },
];

export const ShortService = [
  [
    {
      title: 'বিশ্বস্ত এবং নির্ভরযোগ্য আমদানিকারক কোম্পানি',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'চীনের শীর্ষস্থানীয় বাজার থেকে সরাসরি আমদানি',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'সাশ্রয়ী মূল্য এবং দ্রুত ডেলিভারি',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
  ],
  [
    {
      title: 'সহজ এবং সুবিধাজনক অনলাইন অর্ডার প্রক্রিয়া',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'পেশাদার কাস্টমস ক্লিয়ারেন্স এবং শিপিং সেবা',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
    {
      title: 'গ্রাহক সন্তুষ্টি এবং সমর্থনে অগ্রণী',
      icon: (props: LucideProps) => (
        <CircleCheckBig {...props} />
      ),
    },
  ],
];

export const FAQ = [
  {
    title: 'Sample Order দেওয়া যাবে?',
    description:
      'হ্যাঁ, আপনি প্রথমে Sample Order দিতে পারেন। এতে কোয়ালিটি যাচাই করা সহজ হয়।',
  },
  {
    title: 'আমি কি হোলসেল অর্ডার দিতে পারবো',
    description:
      'অবশ্যই, আমরা হোলসেল ও কর্পোরেট অর্ডার গ্রহণ করি। ইনবক্সে বিস্তারিত জানান।',
  },
  {
    title: 'প্রি-অর্ডার মানে কী?',
    description:
      'প্রি-অর্ডার মানে হচ্ছে পণ্যটি আমাদের স্টকে নেই — আমরা চীনের ফ্যাক্টরি থেকে অর্ডার করে আনব। এজন্য ৫০%-৭০% অগ্রিম পেমেন্ট লাগে।',
  },
  {
    title: 'আমি কিভাবে অর্ডার করবো?',
    description:
      'আপনার পছন্দের প্রোডাক্টের স্ক্রিনশট বা ছবি ইনবক্সে পাঠান। আমাদের টিম পণ্যের দাম এবং পেমেন্ট প্রসেস জানিয়ে দেবে।',
  },
  {
    title: 'ডেলিভারি সময় কত লাগে?',
    description:
      'প্রি-অর্ডার পণ্য: ১৩–১৫ দিন ( China To Dhaka )। স্টক পণ্য: ২-৩ কার্যদিবসের মধ্যে ডেলিভারি সম্পন্ন হয়।',
  },
  {
    title: 'পেমেন্ট কিভাবে করবো?',
    description:
      'আমরা নিচের পদ্ধতিতে পেমেন্ট গ্রহণ করিঃ বিকাশ, নগদ, রকেট, ব্যাংক ট্রান্সফার।',
  },
  {
    title: 'প্রোডাক্ট ভুল বা ড্যামেজ এলে কী হবে?',
    description:
      'চিন্তা নেই 😊 ডেলিভারির সময় কোনো সমস্যা হলে রিফান্ড বা রিপ্লেসমেন্ট দেওয়া হয় (প্রমাণসহ জানাতে হবে)।',
  },
];
